New User Run:
```
module.ali_test_user.aws_iam_access_key.default will be created
  + resource "aws_iam_access_key" "default" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "aliTestUser"
    }

  # module.ali_test_user.aws_iam_group.default[0] will be created
  + resource "aws_iam_group" "default" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "aliTestUser"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.ali_test_user.aws_iam_group_policy.default[0] will be created
  + resource "aws_iam_group_policy" "default" {
      + group  = "aliTestUser"
      + id     = (known after apply)
      + name   = "aliTestUser"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lambda:UpdateFunctionCode",
                          + "lambda:ListVersionsByFunction",
                          + "lambda:PublishVersion",
                          + "lambda:UpdateAlias",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:lambda:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.ali_test_user.aws_iam_user.default will be created
  + resource "aws_iam_user" "default" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "aliTestUser"
      + path          = "/"
      + tags          = {
          + "name" = "testing"
        }
      + tags_all      = {
          + "name" = "testing"
        }
      + unique_id     = (known after apply)
    }

  # module.ali_test_user.aws_iam_user_group_membership.default will be created
  + resource "aws_iam_user_group_membership" "default" {
      + groups = [
          + "aliTestUser",
        ]
      + id     = (known after apply)
      + user   = "aliTestUser"
    }

  # module.ali_test_user.aws_ssm_parameter.access_key_id will be created
  + resource "aws_ssm_parameter" "access_key_id" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "/alitestuser/credentials/access_key_id"
      + tags      = {
          + "name" = "testing"
        }
      + tags_all  = {
          + "name" = "testing"
        }
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # module.ali_test_user.aws_ssm_parameter.secret_access_key will be created
  + resource "aws_ssm_parameter" "secret_access_key" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "/alitestuser/credentials/secret_access_key"
      + tags      = {
          + "name" = "testing"
        }
      + tags_all  = {
          + "name" = "testing"
        }
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }
```